#include <stdio.h>

void main4() {
	// 변수 : 저장공간 (자구 쓸 것 같은 혹은 자주 바뀔 것 같은 값을 미리 저장)
	// 숫자형, 소수점있는숫자형, 글자형, ... : 자료형(type)
	34 - 3;		// 뺄셈 or 주소 (개발자의 의도파악x)
	// 소수점 의외의 숫자는 다 짜르고 싶음
	3.14;		// 개발자의 의도 반영이 필요 -> 자료형 ex)int, float, char, ...

	// 변수 : 칼
	// 자료형 : 법
	//float num1 = "글자ㅁㅁ";		// 잘못 사용 -> 오류발생으로 실행x
	// 자료형 : 1. 개발자의 의로를 파악 2. 오용 방지

	// int : 정수형 (소수점 없는숫자)
	// float : 실수형 (소수점있는 숫자)
	// char : 문자형 (한글자 ' ')
	// char[] : 문자열형 (글자 " ")
	// bool : 불린형 (True,False)

	int 뺄셈 = 24 - 12;		// 12
	char 주소[100] = "34-1";		// 34-1
}